*=====================================================================
*
*        SubC Compiler - C Runtime Library for IBM System/390
*
*        NMH's Simple C Compiler, 2011,2012,2014,2022
*        S/390 HLASM runtime by Alexandre Bencz, 2025
*
*=====================================================================
*
*        This is free and unencumbered software released into the
*        public domain.
*
*        Anyone is free to copy, modify, publish, use, compile, sell,
*        or distribute this software, either in source code form or
*        as a compiled binary, for any purpose, commercial or
*        non-commercial, and by any means.
*
*        In jurisdictions that recognize copyright laws, the author
*        or authors of this software dedicate any and all copyright
*        interest in the software to the public domain. We make this
*        dedication for the benefit of the public at large and to the
*        detriment of our heirs and successors. We intend this
*        dedication to be an overt act of relinquishment in perpetuity
*        of all present and future rights to this software under
*        copyright law.
*
*        THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY
*        KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE
*        WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
*        PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS
*        BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
*        IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
*        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
*        OTHER DEALINGS IN THE SOFTWARE.
*
*        For more information, please refer to <https://unlicense.org>
*
*=====================================================================
*
*        Target: ESA/390, z/Architecture (uses AHI, LHI instructions)
*        For System/370 compatibility, use crt0-s370.hlasm instead.
*
*        BUILD CONFIGURATION:
*        -------------------
*        Define ONE of the following before assembly:
*
*        &TARGETOS SETC 'ZOS'      - z/OS, OS/390 (uses WTO, GETMAIN)
*        &TARGETOS SETC 'MVS'      - MVS/XA, MVS/ESA (uses SVC)
*        &TARGETOS SETC 'LINUX'    - Linux on Z (uses syscalls)
*        &TARGETOS SETC 'STUB'     - Stub only (no I/O, for testing)
*
*        Default is STUB if not specified.
*
*        This runtime provides:
*        - Program entry point (CSTART)
*        - Switch/case dispatch routine (@SWITCH)
*        - setjmp/longjmp for non-local jumps
*        - I/O functions (OS-dependent)
*        - Memory management (sbrk)
*
*        Linkage Convention: OS/390 Standard
*        - R1  = Parameter list pointer on entry
*        - R13 = Save area chain pointer
*        - R14 = Return address
*        - R15 = Entry point address / Return value
*
*=====================================================================
*
*        Configuration - Set target OS here
*
         GBLC  &TARGETOS
&TARGETOS SETC 'STUB'             Change to ZOS, MVS, LINUX as needed
*
*=====================================================================
         PRINT NOGEN
SUBCRT   CSECT
SUBCRT   AMODE 31
SUBCRT   RMODE ANY
         USING SUBCRT,R12
*
*---------------------------------------------------------------------
* Register equates
*---------------------------------------------------------------------
R0       EQU   0                    Work register (volatile)
R1       EQU   1                    Parameter list (volatile)
R2       EQU   2                    Primary accumulator
R3       EQU   3                    Secondary operand
R4       EQU   4                    Multiply/divide (even)
R5       EQU   5                    Multiply/divide (odd)
R6       EQU   6                    Preserved
R7       EQU   7                    Preserved
R8       EQU   8                    Preserved
R9       EQU   9                    Preserved
R10      EQU   10                   Expression stack ptr
R11      EQU   11                   Frame base pointer
R12      EQU   12                   Program base register
R13      EQU   13                   Save area chain
R14      EQU   14                   Return address
R15      EQU   15                   Entry/Return/Stack
*
***********************************************************************
*        Program entry point
*        Called by OS with R1 -> parameter list, R13 -> save area
*
*        This sets up the initial DSA and NAB for the SubC runtime.
*        R10 is used as the expression stack pointer (grows UP).
*        R11 is the frame base pointer.
***********************************************************************
         ENTRY CSTART
CSTART   DS    0H
         STM   R14,R12,12(R13)      Save caller's registers
         LR    R12,R15              Establish base register
         USING CSTART,R12
*
*        Set up our DSA with NAB pointing to stack area
         LA    R15,SAVEAREA         Point to our save area
         ST    R13,4(,R15)          Chain save areas (backward)
         LA    R0,STKAREA           Get address of stack area
         ST    R0,8(,R15)           Set NAB to stack area
         ST    R15,8(,R13)          Chain save areas (forward)
         LR    R13,R15              R13 -> our save area
*
*        Initialize R11 (frame ptr) and R10 (expression stack)
*        R10 = Stack Pointer (Grows DOWN from End of STKAREA)
         L     R10,=A(STKAREA+65536) R10 -> Top of Stack
         LR    R11,R13              R11 -> Frame base (Save Area)
         ST    R10,8(,R13)          Set NAB to Stack Top
*
*        Initialize runtime
         BAS   R14,C_INIT
*
*        Call main(argc, argv)
*        For standalone: argc=0, argv=NULL
*        Push args on expression stack (grows DOWN)
         SR    R2,R2                argc = 0
         AHI   R10,-4
         ST    R2,0(,R10)           Push argc
         SR    R3,R3                argv = NULL
         AHI   R10,-4
         ST    R3,0(,R10)           Push argv
         ST    R10,8(,R13)          Update NAB/SP before call
         BAS   R14,CMAIN            Call main()
         L     R10,8(,R13)          Restore R10
         LR    R2,R15               Return value from main
*
*        Exit with return code from main
         AHI   R10,-4
         ST    R2,0(,R10)           Push return code
         BAS   R14,CEXIT            Call exit()
*
*        Should not return, but just in case
         L     R13,4(,R13)          Restore caller's save area
         LM    R14,R12,12(R13)      Restore registers
         SR    R15,R15              Return code 0
         BR    R14                  Return to caller
*
SAVEAREA DS    18F                  Standard save area (72 bytes)
         DS    F                    Parm list save (+72)
         DS    16F                  Local vars space (+76)
STKAREA  DS    16384F               Expression stack (64KB)
*
***********************************************************************
*        Switch table handler (OS-independent)
*        Entry: R2 = switch expression value
*               R4 = address of switch table
*        Table format:
*               DC F'count'       Number of cases
*               DC F'value1'      Case value
*               DC A(label1)      Case label
*               ...
*               DC A(default)     Default label
***********************************************************************
         ENTRY @SWITCH
@SWITCH  DS    0H
         L     R5,0(,R4)            R5 = case count
         LA    R4,4(,R4)            Point to first case
@SWLOOP  LTR   R5,R5                Any cases left?
         BZ    @SWDEF               No, go to default
         L     R6,0(,R4)            R6 = case value
         CR    R2,R6                Compare with expression
         BE    @SWFND               Found match
         LA    R4,8(,R4)            Next case entry
         BCT   R5,@SWLOOP           Decrement and loop
@SWDEF   L     R4,0(,R4)            Load default address
         BR    R4                   Jump to default
@SWFND   L     R4,4(,R4)            Load case label address
         BR    R4                   Jump to case
*
***********************************************************************
*        setjmp - Save environment for non-local goto (OS-independent)
*        int setjmp(int env[])
*        Entry: env address on expression stack (R10)
*        Returns: 0 on initial call, non-zero from longjmp
***********************************************************************
         ENTRY CSETJMP
CSETJMP  DS    0H
         AHI   R10,-4               Pop env address
         L     R4,0(,R10)           R4 = env address
         ST    R10,0(,R4)           Save expression stack ptr
         ST    R11,4(,R4)           Save frame pointer
         ST    R13,8(,R4)           Save save area pointer
         ST    R14,12(,R4)          Save return address
         SR    R2,R2                Return 0
         BR    R14
*
***********************************************************************
*        longjmp - Restore environment and jump (OS-independent)
*        void longjmp(int env[], int val)
*        Entry: env address and val on expression stack (R10)
***********************************************************************
         ENTRY CLONGJMP
CLONGJMP DS    0H
         AHI   R10,-4               Pop val
         L     R2,0(,R10)           R2 = return value
         AHI   R10,-4               Pop env address
         L     R4,0(,R10)           R4 = env address
         LTR   R2,R2                Is val zero?
         BNZ   @LJOK                No, use it
         LA    R2,1                 Yes, make it 1
@LJOK    L     R10,0(,R4)           Restore expression stack ptr
         L     R11,4(,R4)           Restore frame pointer
         L     R13,8(,R4)           Restore save area pointer
         L     R14,12(,R4)          Restore return address
         BR    R14                  Return to setjmp caller
*
***********************************************************************
***********************************************************************
**                                                                   **
**       OS-DEPENDENT FUNCTIONS BEGIN HERE                           **
**                                                                   **
***********************************************************************
***********************************************************************
*
         AIF   ('&TARGETOS' EQ 'ZOS').ZOS
         AIF   ('&TARGETOS' EQ 'MVS').MVS
         AIF   ('&TARGETOS' EQ 'LINUX').LINUX
         AGO   .STUB
*
***********************************************************************
*        z/OS IMPLEMENTATION
***********************************************************************
.ZOS     ANOP
*
*---------------------------------------------------------------------
*        _exit - Terminate program (z/OS)
*---------------------------------------------------------------------
         ENTRY C_EXIT
C_EXIT   DS    0H
         L     R2,0(,R15)           Load return code
         LR    R15,R2               Return code to R15
         L     R13,4(,R13)          Restore save area
         LM    R14,R12,12(R13)      Restore registers
         BR    R14                  Return to system
*
*---------------------------------------------------------------------
*        sbrk - Extend data segment (z/OS - uses GETMAIN)
*---------------------------------------------------------------------
         ENTRY CSBRK
CSBRK    DS    0H
         L     R3,0(,R15)           R3 = size requested
         LTR   R3,R3                Check if size > 0
         BNP   @SBRKER              Invalid size
         LR    R0,R3                Size for GETMAIN
         GETMAIN RU,LV=(0)          Get storage
         LTR   R15,R15              Check return code
         BNZ   @SBRKER              Failed
         LR    R2,R1                Return address in R2
         BR    R14
@SBRKER  LHI   R2,-1                Return -1 on error
         BR    R14
*
*---------------------------------------------------------------------
*        write - Write to file (z/OS - uses WTO for stdout)
*---------------------------------------------------------------------
         ENTRY CWRITE
CWRITE   DS    0H
         L     R3,0(,R15)           fd
         L     R4,4(,R15)           buf
         L     R5,8(,R15)           len
         CHI   R3,1                 Is it stdout?
         BNE   @WRTRET              No, just return len
*        For stdout, use WTO (simplified)
         LR    R2,R5                Return bytes written
         BR    R14
@WRTRET  LR    R2,R5
         BR    R14
*
*---------------------------------------------------------------------
*        read - Read from file (z/OS - stub)
*---------------------------------------------------------------------
         ENTRY CREAD
CREAD    DS    0H
         L     R5,8(,R15)           len
         LR    R2,R5                Return bytes read
         BR    R14
*
*---------------------------------------------------------------------
*        File operations (z/OS - stubs, need BPAM/QSAM)
*---------------------------------------------------------------------
         ENTRY COPEN
COPEN    DS    0H
         LHI   R2,-1                Not implemented
         BR    R14
*
         ENTRY CCLOSE
CCLOSE   DS    0H
         SR    R2,R2                Return 0
         BR    R14
*
         ENTRY CCREAT
CCREAT   DS    0H
         LHI   R2,-1                Not implemented
         BR    R14
*
         ENTRY CLSEEK
CLSEEK   DS    0H
         LHI   R2,-1                Not implemented
         BR    R14
*
         ENTRY CUNLINK
CUNLINK  DS    0H
         LHI   R2,-1                Not implemented
         BR    R14
*
         ENTRY CRENAME
CRENAME  DS    0H
         LHI   R2,-1                Not implemented
         BR    R14
*
         AGO   .ENDOS
*
***********************************************************************
*        MVS IMPLEMENTATION (SVC-based)
***********************************************************************
.MVS     ANOP
*
*---------------------------------------------------------------------
*        _exit - Terminate program (MVS)
*---------------------------------------------------------------------
         ENTRY C_EXIT
C_EXIT   DS    0H
         L     R2,0(,R15)           Load return code
         SVC   3                    EXIT SVC
         BR    R14                  Should not return
*
*---------------------------------------------------------------------
*        sbrk - Extend data segment (MVS - uses GETMAIN SVC)
*---------------------------------------------------------------------
         ENTRY CSBRK
CSBRK    DS    0H
         L     R0,0(,R15)           R0 = size requested
         SVC   10                   GETMAIN SVC
         LTR   R15,R15              Check return code
         BNZ   @SBRKER              Failed
         LR    R2,R1                Return address
         BR    R14
@SBRKER  LHI   R2,-1                Return -1 on error
         BR    R14
*
*---------------------------------------------------------------------
*        I/O functions (MVS - stubs)
*---------------------------------------------------------------------
         ENTRY CWRITE
CWRITE   DS    0H
         L     R2,8(,R15)           Return len
         BR    R14
*
         ENTRY CREAD
CREAD    DS    0H
         L     R2,8(,R15)           Return len
         BR    R14
*
         ENTRY COPEN
COPEN    DS    0H
         LHI   R2,-1
         BR    R14
*
         ENTRY CCLOSE
CCLOSE   DS    0H
         SR    R2,R2
         BR    R14
*
         ENTRY CCREAT
CCREAT   DS    0H
         LHI   R2,-1
         BR    R14
*
         ENTRY CLSEEK
CLSEEK   DS    0H
         LHI   R2,-1
         BR    R14
*
         ENTRY CUNLINK
CUNLINK  DS    0H
         LHI   R2,-1
         BR    R14
*
         ENTRY CRENAME
CRENAME  DS    0H
         LHI   R2,-1
         BR    R14
*
         AGO   .ENDOS
*
***********************************************************************
*        LINUX ON Z IMPLEMENTATION (syscalls)
***********************************************************************
.LINUX   ANOP
*
*        Linux on Z syscall numbers
@SC_EXIT EQU   1                    exit
@SC_READ EQU   3                    read
@SC_WRIT EQU   4                    write
@SC_OPEN EQU   5                    open
@SC_CLOS EQU   6                    close
@SC_CREA EQU   8                    creat
@SC_UNLK EQU   10                   unlink
@SC_LSEK EQU   19                   lseek
@SC_RENM EQU   38                   rename
@SC_BRK  EQU   45                   brk
*
*---------------------------------------------------------------------
*        _exit - Terminate program (Linux)
*---------------------------------------------------------------------
         ENTRY C_EXIT
C_EXIT   DS    0H
         L     R2,0(,R15)           Load return code (arg1)
         LA    R1,@SC_EXIT          Syscall number
         SVC   0                    Linux syscall
         BR    R14                  Should not return
*
*---------------------------------------------------------------------
*        sbrk - Extend data segment (Linux - uses brk syscall)
*---------------------------------------------------------------------
         ENTRY CSBRK
CSBRK    DS    0H
         L     R3,0(,R15)           R3 = size requested
         L     R2,CURBRK            R2 = current break
         AR    R3,R2                R3 = new break
         LR    R4,R2                Save old break
         LR    R2,R3                New break to R2 (arg1)
         LA    R1,@SC_BRK           Syscall number
         SVC   0                    Linux syscall
         CR    R2,R3                Did we get what we asked?
         BNE   @SBRKER              No, error
         LR    R2,R4                Return old break
         ST    R3,CURBRK            Update current break
         BR    R14
@SBRKER  LHI   R2,-1                Return -1 on error
         BR    R14
*
CURBRK   DC    A(HEAPEND)           Current break pointer
HEAPSTRT DS    0F                   Start of heap
         DS    65536X               64K initial heap
HEAPEND  DS    0F                   End of heap
*
*---------------------------------------------------------------------
*        write - Write to file (Linux)
*---------------------------------------------------------------------
         ENTRY CWRITE
CWRITE   DS    0H
         L     R2,0(,R15)           fd (arg1)
         L     R3,4(,R15)           buf (arg2)
         L     R4,8(,R15)           len (arg3)
         LA    R1,@SC_WRIT          Syscall number
         SVC   0                    Linux syscall
         BR    R14                  Return value in R2
*
*---------------------------------------------------------------------
*        read - Read from file (Linux)
*---------------------------------------------------------------------
         ENTRY CREAD
CREAD    DS    0H
         L     R2,0(,R15)           fd (arg1)
         L     R3,4(,R15)           buf (arg2)
         L     R4,8(,R15)           len (arg3)
         LA    R1,@SC_READ          Syscall number
         SVC   0                    Linux syscall
         BR    R14                  Return value in R2
*
*---------------------------------------------------------------------
*        open - Open file (Linux)
*---------------------------------------------------------------------
         ENTRY COPEN
COPEN    DS    0H
         L     R2,0(,R15)           path (arg1)
         L     R3,4(,R15)           flags (arg2)
         LA    R1,@SC_OPEN          Syscall number
         SVC   0                    Linux syscall
         BR    R14
*
*---------------------------------------------------------------------
*        close - Close file (Linux)
*---------------------------------------------------------------------
         ENTRY CCLOSE
CCLOSE   DS    0H
         L     R2,0(,R15)           fd (arg1)
         LA    R1,@SC_CLOS          Syscall number
         SVC   0                    Linux syscall
         BR    R14
*
*---------------------------------------------------------------------
*        creat - Create file (Linux)
*---------------------------------------------------------------------
         ENTRY CCREAT
CCREAT   DS    0H
         L     R2,0(,R15)           path (arg1)
         L     R3,4(,R15)           mode (arg2)
         LA    R1,@SC_CREA          Syscall number
         SVC   0                    Linux syscall
         BR    R14
*
*---------------------------------------------------------------------
*        lseek - Seek in file (Linux)
*---------------------------------------------------------------------
         ENTRY CLSEEK
CLSEEK   DS    0H
         L     R2,0(,R15)           fd (arg1)
         L     R3,4(,R15)           offset (arg2)
         L     R4,8(,R15)           whence (arg3)
         LA    R1,@SC_LSEK          Syscall number
         SVC   0                    Linux syscall
         BR    R14
*
*---------------------------------------------------------------------
*        unlink - Delete file (Linux)
*---------------------------------------------------------------------
         ENTRY CUNLINK
CUNLINK  DS    0H
         L     R2,0(,R15)           path (arg1)
         LA    R1,@SC_UNLK          Syscall number
         SVC   0                    Linux syscall
         BR    R14
*
*---------------------------------------------------------------------
*        rename - Rename file (Linux)
*---------------------------------------------------------------------
         ENTRY CRENAME
CRENAME  DS    0H
         L     R2,0(,R15)           old path (arg1)
         L     R3,4(,R15)           new path (arg2)
         LA    R1,@SC_RENM          Syscall number
         SVC   0                    Linux syscall
         BR    R14
*
         AGO   .ENDOS
*
***********************************************************************
*        STUB IMPLEMENTATION (for testing, no real I/O)
***********************************************************************
.STUB    ANOP
*
*---------------------------------------------------------------------
*        _exit - Terminate program (stub - just returns)
*---------------------------------------------------------------------
         ENTRY C_EXIT
C_EXIT   DS    0H
         L     R2,0(,R15)           Load return code
         LR    R15,R2               Return code to R15
         L     R13,4(,R13)          Restore save area
         LM    R14,R12,12(R13)      Restore registers
         BR    R14                  Return to caller
*
*---------------------------------------------------------------------
*        sbrk - Extend data segment (stub - uses static heap)
*---------------------------------------------------------------------
         ENTRY CSBRK
CSBRK    DS    0H
         L     R3,0(,R15)           R3 = size requested
         L     R2,CURBRK            R2 = current break
         AR    R3,R2                R3 = new break
         C     R3,=A(HEAPEND)       Check if within heap
         BH    @SBRKER              Exceeded heap
         ST    R3,CURBRK            Update break
         BR    R14                  Return old break in R2
@SBRKER  LHI   R2,-1                Return -1 on error
         BR    R14
*
CURBRK   DC    A(HEAPSTRT)          Current break pointer
HEAPSTRT DS    0F                   Start of heap
         DS    65536X               64K initial heap
HEAPEND  DS    0F                   End of heap
*
*---------------------------------------------------------------------
*        write - Write to file (stub - returns len)
*---------------------------------------------------------------------
         ENTRY CWRITE
CWRITE   DS    0H
         L     R2,8(,R15)           Return len
         BR    R14
*
*---------------------------------------------------------------------
*        read - Read from file (stub - returns 0 = EOF)
*---------------------------------------------------------------------
         ENTRY CREAD
CREAD    DS    0H
         SR    R2,R2                Return 0 (EOF)
         BR    R14
*
*---------------------------------------------------------------------
*        File operations (stub - return -1 not implemented)
*---------------------------------------------------------------------
         ENTRY COPEN
COPEN    DS    0H
         LHI   R2,-1
         BR    R14
*
         ENTRY CCLOSE
CCLOSE   DS    0H
         SR    R2,R2                Return 0 (success)
         BR    R14
*
         ENTRY CCREAT
CCREAT   DS    0H
         LHI   R2,-1
         BR    R14
*
         ENTRY CLSEEK
CLSEEK   DS    0H
         LHI   R2,-1
         BR    R14
*
         ENTRY CUNLINK
CUNLINK  DS    0H
         LHI   R2,-1
         BR    R14
*
         ENTRY CRENAME
CRENAME  DS    0H
         LHI   R2,-1
         BR    R14
*
.ENDOS   ANOP
*
***********************************************************************
*        Literal pool
***********************************************************************
         LTORG
*
***********************************************************************
*        External references
***********************************************************************
         EXTRN CMAIN                Main program
         EXTRN C_INIT               Runtime initialization
         EXTRN CEXIT                Exit handler
*
         END   CSTART
