*=====================================================================
*
*        SubC Compiler - C Runtime Library for IBM System/370
*
*        NMH's Simple C Compiler, 2011,2012,2014,2022
*        S/370 HLASM runtime by Alexandre Bencz, 2025
*
*=====================================================================
*
*        This is free and unencumbered software released into the
*        public domain.
*
*        Anyone is free to copy, modify, publish, use, compile, sell,
*        or distribute this software, either in source code form or
*        as a compiled binary, for any purpose, commercial or
*        non-commercial, and by any means.
*
*        In jurisdictions that recognize copyright laws, the author
*        or authors of this software dedicate any and all copyright
*        interest in the software to the public domain. We make this
*        dedication for the benefit of the public at large and to the
*        detriment of our heirs and successors. We intend this
*        dedication to be an overt act of relinquishment in perpetuity
*        of all present and future rights to this software under
*        copyright law.
*
*        THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY
*        KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE
*        WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
*        PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS
*        BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
*        IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
*        OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
*        OTHER DEALINGS IN THE SOFTWARE.
*
*        For more information, please refer to <https://unlicense.org>
*
*=====================================================================
*
*        Target: System/370 (NO AHI, LHI instructions)
*        This version uses only base S/370 instructions for
*        compatibility with older systems and emulators.
*
*        For ESA/390 or z/Architecture, use crt0-s390.hlasm instead
*        which uses more efficient AHI/LHI instructions.
*
*        BUILD CONFIGURATION:
*        -------------------
*        Define ONE of the following before assembly:
*
*        &TARGETOS SETC 'MVS'      - MVS/370, MVS/XA (uses SVC)
*        &TARGETOS SETC 'VM'       - VM/CMS (uses DIAG)
*        &TARGETOS SETC 'DOS'      - DOS/VSE
*        &TARGETOS SETC 'STUB'     - Stub only (no I/O, for testing)
*
*        Default is STUB if not specified.
*
*        This runtime provides:
*        - Program entry point (CSTART)
*        - Switch/case dispatch routine (@SWITCH)
*        - setjmp/longjmp for non-local jumps
*        - I/O functions (OS-dependent)
*        - Memory management (sbrk)
*
*        Linkage Convention: Standard OS Linkage
*        - R1  = Parameter list pointer on entry
*        - R13 = Save area chain pointer
*        - R14 = Return address
*        - R15 = Entry point address / Return value
*
*=====================================================================
*
*        Configuration - Set target OS here
*
         GBLC  &TARGETOS
&TARGETOS SETC 'STUB'             Change to MVS, VM, DOS as needed
*
*=====================================================================
         PRINT NOGEN
SUBCRT   CSECT
         USING SUBCRT,R12
*
*---------------------------------------------------------------------
* Register equates
*---------------------------------------------------------------------
R0       EQU   0                    Work register (volatile)
R1       EQU   1                    Parameter list (volatile)
R2       EQU   2                    Primary accumulator
R3       EQU   3                    Secondary operand
R4       EQU   4                    Multiply/divide (even)
R5       EQU   5                    Multiply/divide (odd)
R6       EQU   6                    Preserved
R7       EQU   7                    Preserved
R8       EQU   8                    Preserved
R9       EQU   9                    Preserved
R10      EQU   10                   Preserved
R11      EQU   11                   Frame base pointer
R12      EQU   12                   Program base register
R13      EQU   13                   Save area chain
R14      EQU   14                   Return address
R15      EQU   15                   Entry/Return/Stack
*
***********************************************************************
*        Program entry point
*        Called by OS with R1 -> parameter list, R13 -> save area
***********************************************************************
         ENTRY CSTART
CSTART   DS    0H
         STM   R14,R12,12(R13)      Save caller's registers
         LR    R12,R15              Establish base register
         USING CSTART,R12
         LA    R15,SAVEAREA         Point to our save area
         ST    R13,4(,R15)          Chain save areas (backward)
         ST    R15,8(,R13)          Chain save areas (forward)
         LR    R13,R15              R13 -> our save area
*
*        Initialize runtime
         BAS   R14,C_INIT
*
*        Call main(argc, argv)
*        For standalone: argc=0, argv=NULL
         SR    R2,R2                argc = 0
         SR    R3,R3                argv = NULL
         S     R15,=F'8'            Allocate stack space (S/370)
         ST    R2,0(,R15)           Push argc
         ST    R3,4(,R15)           Push argv
         BAS   R14,CMAIN            Call main()
         A     R15,=F'8'            Clean stack (S/370)
*
*        Exit with return code from main
         LR    R3,R2                Save return code
         BAS   R14,CEXIT            Call exit()
*
*        Should not return, but just in case
         L     R13,4(,R13)          Restore caller's save area
         LM    R14,R12,12(R13)      Restore registers
         SR    R15,R15              Return code 0
         BR    R14                  Return to caller
*
SAVEAREA DS    18F                  Standard save area (72 bytes)
*
***********************************************************************
*        Switch table handler (OS-independent)
*        Entry: R2 = switch expression value
*               R4 = address of switch table
*        Table format:
*               DC F'count'       Number of cases
*               DC F'value1'      Case value
*               DC A(label1)      Case label
*               ...
*               DC A(default)     Default label
***********************************************************************
         ENTRY @SWITCH
@SWITCH  DS    0H
         L     R5,0(,R4)            R5 = case count
         LA    R4,4(,R4)            Point to first case
@SWLOOP  LTR   R5,R5                Any cases left?
         BZ    @SWDEF               No, go to default
         L     R6,0(,R4)            R6 = case value
         CR    R2,R6                Compare with expression
         BE    @SWFND               Found match
         LA    R4,8(,R4)            Next case entry
         BCT   R5,@SWLOOP           Decrement and loop
@SWDEF   L     R4,0(,R4)            Load default address
         BR    R4                   Jump to default
@SWFND   L     R4,4(,R4)            Load case label address
         BR    R4                   Jump to case
*
***********************************************************************
*        setjmp - Save environment for non-local goto (OS-independent)
*        int setjmp(int env[])
*        Entry: env address in parameter list
*        Returns: 0 on initial call, non-zero from longjmp
***********************************************************************
         ENTRY CSETJMP
CSETJMP  DS    0H
         L     R4,0(,R15)           R4 = env address
         ST    R11,0(,R4)           Save frame pointer
         ST    R13,4(,R4)           Save save area pointer
         ST    R14,8(,R4)           Save return address
         ST    R15,12(,R4)          Save stack pointer
         SR    R2,R2                Return 0
         BR    R14
*
***********************************************************************
*        longjmp - Restore environment and jump (OS-independent)
*        void longjmp(int env[], int val)
*        Entry: env address at 0(R15), val at 4(R15)
***********************************************************************
         ENTRY CLONGJMP
CLONGJMP DS    0H
         L     R4,0(,R15)           R4 = env address
         L     R2,4(,R15)           R2 = return value
         LTR   R2,R2                Is val zero?
         BNZ   @LJOK                No, use it
         LA    R2,1                 Yes, make it 1
@LJOK    L     R11,0(,R4)           Restore frame pointer
         L     R13,4(,R4)           Restore save area pointer
         L     R14,8(,R4)           Restore return address
         L     R15,12(,R4)          Restore stack pointer
         BR    R14                  Return to setjmp caller
*
***********************************************************************
***********************************************************************
**                                                                   **
**       OS-DEPENDENT FUNCTIONS BEGIN HERE                           **
**                                                                   **
***********************************************************************
***********************************************************************
*
         AIF   ('&TARGETOS' EQ 'MVS').MVS
         AIF   ('&TARGETOS' EQ 'VM').VM
         AIF   ('&TARGETOS' EQ 'DOS').DOS
         AGO   .STUB
*
***********************************************************************
*        MVS/370 IMPLEMENTATION (SVC-based)
***********************************************************************
.MVS     ANOP
*
*---------------------------------------------------------------------
*        _exit - Terminate program (MVS)
*---------------------------------------------------------------------
         ENTRY C_EXIT
C_EXIT   DS    0H
         L     R2,0(,R15)           Load return code
         SVC   3                    EXIT SVC
         BR    R14                  Should not return
*
*---------------------------------------------------------------------
*        sbrk - Extend data segment (MVS - uses GETMAIN SVC)
*---------------------------------------------------------------------
         ENTRY CSBRK
CSBRK    DS    0H
         L     R0,0(,R15)           R0 = size requested
         SVC   10                   GETMAIN SVC
         LTR   R15,R15              Check return code
         BNZ   @SBRKER              Failed
         LR    R2,R1                Return address
         BR    R14
@SBRKER  L     R2,=F'-1'            Return -1 on error (S/370)
         BR    R14
*
*---------------------------------------------------------------------
*        I/O functions (MVS - stubs)
*---------------------------------------------------------------------
         ENTRY CWRITE
CWRITE   DS    0H
         L     R2,8(,R15)           Return len
         BR    R14
*
         ENTRY CREAD
CREAD    DS    0H
         L     R2,8(,R15)           Return len
         BR    R14
*
         ENTRY COPEN
COPEN    DS    0H
         L     R2,=F'-1'            Not implemented (S/370)
         BR    R14
*
         ENTRY CCLOSE
CCLOSE   DS    0H
         SR    R2,R2
         BR    R14
*
         ENTRY CCREAT
CCREAT   DS    0H
         L     R2,=F'-1'            Not implemented (S/370)
         BR    R14
*
         ENTRY CLSEEK
CLSEEK   DS    0H
         L     R2,=F'-1'            Not implemented (S/370)
         BR    R14
*
         ENTRY CUNLINK
CUNLINK  DS    0H
         L     R2,=F'-1'            Not implemented (S/370)
         BR    R14
*
         ENTRY CRENAME
CRENAME  DS    0H
         L     R2,=F'-1'            Not implemented (S/370)
         BR    R14
*
         AGO   .ENDOS
*
***********************************************************************
*        VM/CMS IMPLEMENTATION
***********************************************************************
.VM      ANOP
*
*---------------------------------------------------------------------
*        _exit - Terminate program (VM/CMS)
*---------------------------------------------------------------------
         ENTRY C_EXIT
C_EXIT   DS    0H
         L     R2,0(,R15)           Load return code
         LA    R1,@HXCMD            Point to HX command
         SVC   202                  CMS command
         DC    AL4(0)               Error address
         BR    R14                  Should not return
@HXCMD   DC    CL8'HX'              CMS HX (halt execution)
*
*---------------------------------------------------------------------
*        sbrk - Extend data segment (VM - uses static heap)
*---------------------------------------------------------------------
         ENTRY CSBRK
CSBRK    DS    0H
         L     R3,0(,R15)           R3 = size requested
         L     R2,CURBRK            R2 = current break
         AR    R3,R2                R3 = new break
         C     R3,=A(HEAPEND)       Check if within heap
         BH    @SBRKER              Exceeded heap
         ST    R3,CURBRK            Update break
         BR    R14                  Return old break in R2
@SBRKER  L     R2,=F'-1'            Return -1 on error (S/370)
         BR    R14
*
CURBRK   DC    A(HEAPSTRT)          Current break pointer
HEAPSTRT DS    0F                   Start of heap
         DS    65536X               64K initial heap
HEAPEND  DS    0F                   End of heap
*
*---------------------------------------------------------------------
*        I/O functions (VM - stubs, need FSREAD/FSWRITE)
*---------------------------------------------------------------------
         ENTRY CWRITE
CWRITE   DS    0H
         L     R2,8(,R15)           Return len
         BR    R14
*
         ENTRY CREAD
CREAD    DS    0H
         SR    R2,R2                Return 0 (EOF)
         BR    R14
*
         ENTRY COPEN
COPEN    DS    0H
         L     R2,=F'-1'
         BR    R14
*
         ENTRY CCLOSE
CCLOSE   DS    0H
         SR    R2,R2
         BR    R14
*
         ENTRY CCREAT
CCREAT   DS    0H
         L     R2,=F'-1'
         BR    R14
*
         ENTRY CLSEEK
CLSEEK   DS    0H
         L     R2,=F'-1'
         BR    R14
*
         ENTRY CUNLINK
CUNLINK  DS    0H
         L     R2,=F'-1'
         BR    R14
*
         ENTRY CRENAME
CRENAME  DS    0H
         L     R2,=F'-1'
         BR    R14
*
         AGO   .ENDOS
*
***********************************************************************
*        DOS/VSE IMPLEMENTATION
***********************************************************************
.DOS     ANOP
*
*---------------------------------------------------------------------
*        _exit - Terminate program (DOS/VSE)
*---------------------------------------------------------------------
         ENTRY C_EXIT
C_EXIT   DS    0H
         L     R2,0(,R15)           Load return code
         EOJ                        End of job (DOS/VSE)
         BR    R14                  Should not return
*
*---------------------------------------------------------------------
*        sbrk - Extend data segment (DOS - uses static heap)
*---------------------------------------------------------------------
         ENTRY CSBRK
CSBRK    DS    0H
         L     R3,0(,R15)           R3 = size requested
         L     R2,CURBRK            R2 = current break
         AR    R3,R2                R3 = new break
         C     R3,=A(HEAPEND)       Check if within heap
         BH    @SBRKER              Exceeded heap
         ST    R3,CURBRK            Update break
         BR    R14                  Return old break in R2
@SBRKER  L     R2,=F'-1'            Return -1 on error (S/370)
         BR    R14
*
CURBRK   DC    A(HEAPSTRT)          Current break pointer
HEAPSTRT DS    0F                   Start of heap
         DS    65536X               64K initial heap
HEAPEND  DS    0F                   End of heap
*
*---------------------------------------------------------------------
*        I/O functions (DOS - stubs)
*---------------------------------------------------------------------
         ENTRY CWRITE
CWRITE   DS    0H
         L     R2,8(,R15)           Return len
         BR    R14
*
         ENTRY CREAD
CREAD    DS    0H
         SR    R2,R2                Return 0 (EOF)
         BR    R14
*
         ENTRY COPEN
COPEN    DS    0H
         L     R2,=F'-1'
         BR    R14
*
         ENTRY CCLOSE
CCLOSE   DS    0H
         SR    R2,R2
         BR    R14
*
         ENTRY CCREAT
CCREAT   DS    0H
         L     R2,=F'-1'
         BR    R14
*
         ENTRY CLSEEK
CLSEEK   DS    0H
         L     R2,=F'-1'
         BR    R14
*
         ENTRY CUNLINK
CUNLINK  DS    0H
         L     R2,=F'-1'
         BR    R14
*
         ENTRY CRENAME
CRENAME  DS    0H
         L     R2,=F'-1'
         BR    R14
*
         AGO   .ENDOS
*
***********************************************************************
*        STUB IMPLEMENTATION (for testing, no real I/O)
***********************************************************************
.STUB    ANOP
*
*---------------------------------------------------------------------
*        _exit - Terminate program (stub - just returns)
*---------------------------------------------------------------------
         ENTRY C_EXIT
C_EXIT   DS    0H
         L     R2,0(,R15)           Load return code
         LR    R15,R2               Return code to R15
         L     R13,4(,R13)          Restore save area
         LM    R14,R12,12(R13)      Restore registers
         BR    R14                  Return to caller
*
*---------------------------------------------------------------------
*        sbrk - Extend data segment (stub - uses static heap)
*---------------------------------------------------------------------
         ENTRY CSBRK
CSBRK    DS    0H
         L     R3,0(,R15)           R3 = size requested
         L     R2,CURBRK            R2 = current break
         AR    R3,R2                R3 = new break
         C     R3,=A(HEAPEND)       Check if within heap
         BH    @SBRKER              Exceeded heap
         ST    R3,CURBRK            Update break
         BR    R14                  Return old break in R2
@SBRKER  L     R2,=F'-1'            Return -1 on error (S/370)
         BR    R14
*
CURBRK   DC    A(HEAPSTRT)          Current break pointer
HEAPSTRT DS    0F                   Start of heap
         DS    65536X               64K initial heap
HEAPEND  DS    0F                   End of heap
*
*---------------------------------------------------------------------
*        write - Write to file (stub - returns len)
*---------------------------------------------------------------------
         ENTRY CWRITE
CWRITE   DS    0H
         L     R2,8(,R15)           Return len
         BR    R14
*
*---------------------------------------------------------------------
*        read - Read from file (stub - returns 0 = EOF)
*---------------------------------------------------------------------
         ENTRY CREAD
CREAD    DS    0H
         SR    R2,R2                Return 0 (EOF)
         BR    R14
*
*---------------------------------------------------------------------
*        File operations (stub - return -1 not implemented)
*---------------------------------------------------------------------
         ENTRY COPEN
COPEN    DS    0H
         L     R2,=F'-1'            Not implemented (S/370)
         BR    R14
*
         ENTRY CCLOSE
CCLOSE   DS    0H
         SR    R2,R2                Return 0 (success)
         BR    R14
*
         ENTRY CCREAT
CCREAT   DS    0H
         L     R2,=F'-1'            Not implemented (S/370)
         BR    R14
*
         ENTRY CLSEEK
CLSEEK   DS    0H
         L     R2,=F'-1'            Not implemented (S/370)
         BR    R14
*
         ENTRY CUNLINK
CUNLINK  DS    0H
         L     R2,=F'-1'            Not implemented (S/370)
         BR    R14
*
         ENTRY CRENAME
CRENAME  DS    0H
         L     R2,=F'-1'            Not implemented (S/370)
         BR    R14
*
.ENDOS   ANOP
*
***********************************************************************
*        Literal pool
***********************************************************************
         LTORG
*
***********************************************************************
*        External references
***********************************************************************
         EXTRN CMAIN                Main program
         EXTRN C_INIT               Runtime initialization
         EXTRN CEXIT                Exit handler
*
         END   CSTART
